posts/2013-05-31-the-new-blog-with-hakyll.md
---
title: my blog-wiki engine built by hakyll
tags: hakyll, website
---

<p>
This my first blog after I changed to hakyll, I spent lot of time on test different blog engine,
and lot of static site generator. the problem is I have ever really write blogs. this time, should 
be last time change the blog sytem, really? hope so!
</p>

<p>
Ok, now let me show you what's we have on this website, basiclly i use this website to do things below:
</p>

<ul class="org-ul">
<li>Write blogs of course 
</li>
<li>Write puzzles code
</li>
<li>Write GTD reviews 
</li>
<li>host my resume 
</li>
</ul>

<p>
Also have a page for my opensource projects, maybe say project right now. 
I'm sure I'll write more open source projects. add-oil!!!
</p>
